# StructuralSectionCommonCentroidVertical Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionCommonCentroidVertical Property
ParameterTypeId Class See Also
---
"Centroid Vertical"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionCommonCentroidVertical { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionCommonCentroidVertical As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionCommonCentroidVertical {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace